GeFengthe/RTL8762/inc/peripheral/rtl876x_lcd.h
/**
*********************************************************************************************************
*               Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rtl876x_lcd.h
* @brief     header file of lcd 8080 parallel interface driver.
* @details
* @author   elliot chen
* @date     2017-11-23
* @version   v1.0
* *********************************************************************************************************
*/


#ifndef _RTL876x_LCD_H_
#define _RTL876x_LCD_H_

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "rtl876x.h"

/* Peripheral: LCD */
/* Description: LCD register defines */

/* Register: CTRL0 -------------------------------------------------------*/
/* Description: Control register 0. Offset: 0x00. Address: 0x40024800. */

/* CTRL0[31]: LCD_OUTPUT_START. 0x1: Start. 0x0: Stop. */
#define LCD_OUTPUT_START_POS            (31)
#define LCD_OUTPUT_START_MSK            ((uint32_t)0x1 << LCD_OUTPUT_START_POS)
#define LCD_OUTPUT_START_CLR            (~LCD_OUTPUT_START_MSK)
/* CTRL0[15:14]: LCD_GUARD_TIME. */
#define LCD_GUARD_TIME_POS              (14)
#define LCD_GUARD_TIME_MSK              (0x3 << LCD_GUARD_TIME_POS)
#define LCD_GUARD_TIME_CLR              (~LCD_GUARD_TIME_MSK)
/* CTRL0[11]: LCD_BYPASS_GUARD_TIME. 0x1: bypass. 0x0: not bypass. */
#define LCD_BYPASS_GUARD_TIME_POS       (11)
#define LCD_BYPASS_GUARD_TIME_MSK       (0x1 << LCD_BYPASS_GUARD_TIME_POS)
#define LCD_BYPASS_GUARD_TIME_CLR       (~LCD_BYPASS_GUARD_TIME_MSK)
/* CTRL0[9]: LCD_8_BIT_SWAP. */
#define LCD_8_BIT_SWAP_POS              (9)
#define LCD_8_BIT_SWAP_MSK              (0x1 << LCD_8_BIT_SWAP_POS)
#define LCD_8_BIT_SWAP_CLR              (~LCD_8_BIT_SWAP_MSK)
/* CTRL0[8]: LCD_16_BIT_SWAP. */
#define LCD_16_BIT_SWAP_POS             (8)
#define LCD_16_BIT_SWAP_MSK             (0x1 << LCD_16_BIT_SWAP_POS)
#define LCD_16_BIT_SWAP_CLR             (~LCD_16_BIT_SWAP_MSK)
/* CTRL0[6:4]: LCD_SPEED_SEL. */
#define LCD_SPEED_SEL_POS               (4)
#define LCD_SPEED_SEL_MSK               (0x7 << LCD_SPEED_SEL_POS)
#define LCD_SPEED_SEL_CLR               (~LCD_SPEED_SEL_MSK)

/* Register: CTRL1 -------------------------------------------------------*/
/* Description: Control registe 1. Offset: 0x04. Address: 0x40024804. */

/* CTRL1[7:3]: LCD_TX_DMA_FIFO_THR. Fixed to 0x08. */
#define LCD_TX_DMA_FIFO_THR_POS         (3)
#define LCD_TX_DMA_FIFO_THR_MSK         (0x1F << LCD_TX_DMA_FIFO_THR_POS)
#define LCD_TX_DMA_FIFO_THR             (0x08 << LCD_TX_DMA_FIFO_THR_POS)
#define LCD_TX_DMA_FIFO_THR_CLR         (~LCD_TX_DMA_FIFO_THR_MSK)
/* CTRL1[1]: LCD_TX_DMA_SINGLE_LOW. */
#define LCD_TX_DMA_SINGLE_LOW_POS       (1)
#define LCD_TX_DMA_SINGLE_LOW_MSK       (0x1 << LCD_TX_DMA_SINGLE_LOW_POS)
#define LCD_TX_DMA_SINGLE_LOW_CLR       (~LCD_TX_DMA_SINGLE_LOW_MSK)
/* CTRL1[0]: LCD_TX_DMA_EN. */
#define LCD_TX_DMA_EN_POS               (0)
#define LCD_TX_DMA_EN_MSK               (0x1 << LCD_TX_DMA_EN_POS)
#define LCD_TX_DMA_EN_CLR               (~LCD_TX_DMA_EN_MSK)

/* Register: IMR ---------------------------------------------------------*/
/* Description: IMR. Offset: 0x08. Address: 0x40024808. */

/* IMR[10]: LCD_MASK_TX_FIFO_EMPTY_INT. */
#define LCD_MASK_TX_FIFO_EMPTY_INT_POS      (10)
#define LCD_MASK_TX_FIFO_EMPTY_INT_MSK      (0x1 << LCD_MASK_TX_FIFO_EMPTY_INT_POS)
#define LCD_MASK_TX_FIFO_EMPTY_INT_CLR      (~LCD_MASK_TX_FIFO_EMPTY_INT_MSK)
/* IMR[9]: LCD_MASK_TX_FIFO_OVERFLOW_INT. */
#define LCD_MASK_TX_FIFO_OVERFLOW_INT_POS   (9)
#define LCD_MASK_TX_FIFO_OVERFLOW_INT_MSK   (0x1 << LCD_MASK_TX_FIFO_OVERFLOW_INT_POS)
#define LCD_MASK_TX_FIFO_OVERFLOW_INT_CLR   (~LCD_MASK_TX_FIFO_OVERFLOW_INT_MSK)
/* IMR[8]: LCD_MASK_TX_FIFO_THR_INT. */
#define LCD_MASK_TX_FIFO_THR_INT_POS        (8)
#define LCD_MASK_TX_FIFO_THR_INT_MSK        (0x1 << LCD_MASK_TX_FIFO_THR_INT_POS)
#define LCD_MASKTX_FIFO_THR_INT_CLR         (~LCD_MASK_TX_FIFO_THR_INT_MSK)
/* IMR[4:0]: LCD_TX_FIFO_THRESHOLD. */
#define LCD_TX_FIFO_THRESHOLD_POS           (0)
#define LCD_TX_FIFO_THRESHOLD_MSK           (0x1F << LCD_TX_FIFO_THRESHOLD_POS)
#define LCD_TX_FIFO_THRESHOLD_CLR           (~LCD_TX_FIFO_THRESHOLD_MSK)

/* Register: SR ---------------------------------------------------------*/
/* Description: SR. Offset: 0x0C. Address: 0x4002480C. */
/* SR[26]: LCD_AUTO_DONE_INT. */
#define LCD_AUTO_DONE_INT_POS           (26)
#define LCD_AUTO_DONE_INT_MSK           (0x1 << LCD_AUTO_DONE_INT_POS)
#define LCD_AUTO_DONE_INT_CLR           (~LCD_AUTO_DONE_INT_MSK)
/* SR[20]: LCD_TX_FIFO_EMPTY_FLAG. */
#define LCD_TX_FIFO_EMPTY_FLAG_POS      (20)
#define LCD_TX_FIFO_EMPTY_FLAG_MSK      (0x1 << LCD_TX_FIFO_EMPTY_FLAG_POS)
#define LCD_TX_FIFO_EMPTY_FLAG_CLR      (~LCD_TX_FIFO_EMPTY_FLAG_MSK)
/* SR[19]: LCD_TX_FIFO_FULL_FLAG. */
#define LCD_TX_FIFO_FULL_FLAG_POS       (19)
#define LCD_TX_FIFO_FULL_FLAG_MSK       (0x1 << LCD_TX_FIFO_FULL_FLAG_POS)
#define LCD_TX_FIFO_FULL_FLAG_CLR       (~LCD_TX_FIFO_FULL_FLAG_MSK)

/* SR[18]: LCD_TX_FIFO_EMPTY_INT. */
#define LCD_TX_FIFO_EMPTY_INT_POS       (18)
#define LCD_TX_FIFO_EMPTY_INT_MSK       (0x1 << LCD_TX_FIFO_EMPTY_INT_POS)
#define LCD_TX_FIFO_EMPTY_INT_CLR       (~LCD_TX_FIFO_EMPTY_INT_MSK)
/* SR[17]: LCD_TX_FIFO_OVERFLOW_INT. */
#define LCD_TX_FIFO_OVERFLOW_INT_POS    (17)
#define LCD_TX_FIFO_OVERFLOW_INT_MSK    (0x1 << LCD_TX_FIFO_OVERFLOW_INT_POS)
#define LCD_TX_FIFO_OVERFLOW_INT_CLR    (~LCD_TX_FIFO_OVERFLOW_INT_MSK)
/* SR[16]: LCD_TX_FIFO_THR_INT. */
#define LCD_TX_FIFO_THR_INT_POS         (16)
#define LCD_TX_FIFO_THR_INT_MSK         (0x1 << LCD_TX_FIFO_THR_INT_POS)
#define LCD_TX_FIFO_THR_INT_CLR         (~LCD_TX_FIFO_THR_INT_MSK)

/* Register: ICR ---------------------------------------------------------*/
/* Description: Interrupt Clear register. Offset: 0x10. Address: 0x40024810. */

