GeFengthe/RTL8762/inc/peripheral/rtl876x_lcd.h
/* CFG[5]: LCD_CLR_AUTO_DONE_INT. */
#define LCD_CLR_AUTO_DONE_INT_POS       (5)
#define LCD_CLR_AUTO_DONE_INT_MSK       (0x1 << LCD_CLR_AUTO_DONE_INT_POS)
#define LCD_CLR_AUTO_DONE_INT_CLR       (~LCD_CLR_AUTO_DONE_INT_MSK)
/* CFG[4]: LCD_CLR_TF_EMPTY_INT. */
#define LCD_CLR_TF_EMPTY_INT_POS        (4)
#define LCD_CLR_TF_EMPTY_INT_MSK        (0x1 << LCD_CLR_TF_EMPTY_INT_POS)
#define LCD_CLR_TF_EMPTY_INT_CLR        (~LCD_CLR_TF_EMPTY_INT_MSK)
/* CFG[3]: LCD_CLR_TF_OF_INT. */
#define LCD_CLR_TF_OF_INT_POS           (3)
#define LCD_CLR_TF_OF_INT_MSK           (0x1 << LCD_CLR_TF_OF_INT_POS)
#define LCD_CLR_TF_OF_INT_CLR           (~LCD_CLR_TF_OF_INT_MSK)
/* CFG[2]: LCD_CLR_TF_THR_INT. */
#define LCD_CLR_TF_THR_INT_POS          (2)
#define LCD_CLR_TF_THR_INT_MSK          (0x1 << LCD_CLR_TF_THR_INT_POS)
#define LCD_CLR_TF_THR_INT_CLR          (~LCD_CLR_TF_THR_INT_MSK)
/* CFG[1]: LCD_CLR_OUTPUT. */
#define LCD_CLR_OUTPUT_CNT_POS          (1)
#define LCD_CLR_OUTPUT_CNT_MSK          (0x1 << LCD_CLR_OUTPUT_CNT_POS)
#define LCD_CLR_OUTPUT_CNT_CLR          (~LCD_CLR_OUTPUT_CNT_MSK)
/* CFG[0]: LCD_CLR_FIFO. */
#define LCD_CLR_FIFO_POS                (0)
#define LCD_CLR_FIFO_MSK                (0x1 << LCD_CLR_FIFO_POS)
#define LCD_CLR_FIFO_CLR                (~LCD_CLR_FIFO_MSK)

/* Register: CFG ---------------------------------------------------------*/
/* Description: Configure register. Offset: 0x14. Address: 0x40024814. */

/* CFG[31]: LCD_MODE. */
#define LCD_MODE_POS                    (31)
#define LCD_MODE_MSK                    ((uint32_t)0x1 << LCD_MODE_POS)
#define LCD_MODE_CLR                    ((uint32_t)(~LCD_MODE_MSK))
/* CFG[11]: LCD_RD_TRIGGER_CTRL. */
#define LCD_RD_TRIGGER_CTRL_POS         (11)
#define LCD_RD_TRIGGER_CTRL_MSK         (0x1 << LCD_RD_TRIGGER_CTRL_POS)
#define LCD_RD_TRIGGER_CTRL_CLR         (~LCD_RD_TRIGGER_CTRL_MSK)
/* CFG[10]: LCD_WR_TRIGGER_CTRL. */
#define LCD_WR_TRIGGER_CTRL_POS         (10)
#define LCD_WR_TRIGGER_CTRL_MSK         (0x1 << LCD_WR_TRIGGER_CTRL_POS)
#define LCD_WR_TRIGGER_CTRL_CLR         (~LCD_WR_TRIGGER_CTRL_MSK)
/* CFG[9]: LCD_CMD_DATA_CTRL. */
#define LCD_CMD_DATA_CTRL_POS           (9)
#define LCD_CMD_DATA_CTRL_MSK           (0x1 << LCD_CMD_DATA_CTRL_POS)
#define LCD_CMD_DATA_CTRL_CLR           (~LCD_CMD_DATA_CTRL_MSK)
/* CFG[8]: LCD_MANUAL_CS_CTRL. */
#define LCD_MANUAL_CS_CTRL_POS          (8)
#define LCD_MANUAL_CS_CTRL_MSK          (0x1 << LCD_MANUAL_CS_CTRL_POS)
#define LCD_MANUAL_CS_CTRL_CLR          (~LCD_MANUAL_CS_CTRL_MSK)
/* CFG[1:0]: LCD_AUTO_MODE_CMD_NUM. */
#define LCD_AUTO_MODE_CMD_NUM_POS       (0)
#define LCD_AUTO_MODE_CMD_NUM_MSK       (0x3 << LCD_AUTO_MODE_CMD_NUM_POS)
#define LCD_AUTO_MODE_CMD_NUM_CLR       (~LCD_AUTO_MODE_CMD_NUM_MSK)

/* Register: RXDATA -----------------------------------------------------*/
/* Description: RXDATA. Offset: 0x20. Address: 0x40024820. */

/* RXDATA[8]: LCD_RX_DATA_VALID. */
#define LCD_RX_DATA_VALID_POS           (8)
#define LCD_RX_DATA_VALID_MSK           (0x01 << LCD_RX_DATA_VALID_POS)
#define LCD_RX_DATA_VALID_CLR           (~LCD_RX_DATA_VALID_MSK)
/* RXDATA[7:0]: LCD_RX_DATA_. */
#define LCD_RX_DATA_POS                 (0)
#define LCD_RX_DATA_MSK                 (0xFF << LCD_RX_DATA_POS)
#define LCD_RX_DATA_CLR                 (~LCD_RX_DATA_MSK)

/* Register: RGB_LEN -----------------------------------------------------*/
/* Description: RGB_LEN. Offset: 0x24. Address: 0x40024824. */

/* RGB_LEN[16:0]: LCD_OUTPUT_BYTE_NUM. */
#define LCD_OUTPUT_BYTE_NUM_POS         (0)
#define LCD_OUTPUT_BYTE_NUM_MSK         (0x1FFFF << LCD_OUTPUT_BYTE_NUM_POS)
#define LCD_OUTPUT_BYTE_NUM_CLR         (~LCD_OUTPUT_BYTE_NUM_MSK)

/* Register: DATA_CNT ----------------------------------------------------*/
/* Description: DATA_CNT. Offset: 0x28. Address: 0x40024828. */

/* DATA_CNT[16:0]: LCD_OUTPUT_CNT. */
#define LCD_OUTPUT_CNT_POS              (0)
#define LCD_OUTPUT_CNT_MSK              (0x1FFFF << LCD_OUTPUT_CNT_POS)
#define LCD_OUTPUT_CNT_CLR              (~LCD_OUTPUT_CNT_MSK)



/** @addtogroup LCD LCD
  * @brief LCD driver module
  * @{
  */

/** @defgroup LCD_Exported_Types LCD Exported Types
  * @{
  */

/**
 * @brief LCD initialize parameters
 *
 * LCD initialize parameters
 */
typedef struct
{
    uint32_t LCD_ClockDiv;                      /*!< Specifies the LCD clock speed. */
    uint32_t LCD_Mode;                          /*!< Specifies the LCD operation mode. */
    uint32_t LCD_GuardTimeCmd;                  /*!< Specifies the guard time function. */
    uint32_t LCD_GuardTime;                     /*!< Specifies the guard time. This parameter is 0~3T of divider clock. */
    uint32_t LCD_8BitSwap;                      /*!< Specifies the FIFO data format. */
    uint32_t LCD_16BitSwap;                     /*!<Specifies the FIFO data format.  */
    uint32_t LCD_TxThr;                         /*!<Specifies the TX FIFO threshold value.  */
    uint32_t LCD_TxDMACmd;                      /*!<Specifies the TX DMA status in auto mode.  */
} LCD_InitTypeDef;

/**End of group LCD_Exported_Types
  * @}
  */

/** @defgroup LCD_Exported_Constants LCD Exported Constants
  * @{
  */

/** @defgroup LCD_Pin_Group LCD Pin Group
  * @{
  */
#define LCD_PinGroup_DISABLE                        ((uint32_t)0x00)
#define LCD_PinGroup_1                              ((uint32_t)0x01 << 28)
#define LCD_PinGroup_2                              ((uint32_t)0x02 << 28)

#define IS_LCD_PINGROUP_IDX(IDX) (((IDX) == LCD_PinGroup_DISABLE) || ((IDX) == LCD_PinGroup_1) || \
                                  ((IDX) == LCD_PinGroup_2))

/**
  * @}
  */

/** @defgroup LCD_ClockDiv LCD clock div
  * @{
  */

#define LCD_CLOCK_DIV_2                             (((uint32_t)0x0 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_3                             (((uint32_t)0x1 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_4                             (((uint32_t)0x2 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_5                             (((uint32_t)0x3 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_6                             (((uint32_t)0x4 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_7                             (((uint32_t)0x5 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_8                             (((uint32_t)0x6 << LCD_SPEED_SEL_POS))
#define LCD_CLOCK_DIV_16                            (((uint32_t)0x7 << LCD_SPEED_SEL_POS))

#define IS_LCD_CLOCK_DIV(DIV) (((DIV) == LCD_CLOCK_DIV_2) || ((DIV) == LCD_CLOCK_DIV_3)    || \
                               ((DIV) == LCD_CLOCK_DIV_4) || ((DIV) == LCD_CLOCK_DIV_5) || \
                               ((DIV) == LCD_CLOCK_DIV_6) || ((DIV) == LCD_CLOCK_DIV_7) || \
                               ((DIV) == LCD_CLOCK_DIV_8) || ((DIV) == LCD_CLOCK_DIV_16))

/**
  * @}
  */

/** @defgroup LCD_Mode LCD Mode
  * @{
  */

#define LCD_MODE_AUTO                               (0)
#define LCD_MODE_MANUAL                             (LCD_MODE_MSK)

