GeFengthe/RTL8762/inc/peripheral/rtl876x_lcd.h
#define IS_LCD_MODE(MODE) (((MODE) == LCD_MODE_AUTO) || ((MODE) == LCD_MODE_MANUAL))

/**
  * @}
  */

/** @defgroup LCD_GuardTime_Cmd LCD Guard Time Cmd
  * @{
  */

#define LCD_GUARD_TIME_ENABLE                       (0)
#define LCD_GUARD_TIME_DISABLE                      (LCD_BYPASS_GUARD_TIME_MSK)


#define IS_LCD_GUARD_TIME_CMD(CMD) (((CMD) == LCD_GUARD_TIME_ENABLE) || ((CMD) == LCD_GUARD_TIME_DISABLE))

/**
  * @}
  */

/** @defgroup LCD_GuardTime LCD Guard Time
  * @{
  */

#define LCD_GUARD_TIME_1T                           (0)
#define LCD_GUARD_TIME_2T                           (((uint32_t)0x1 << LCD_GUARD_TIME_POS))
#define LCD_GUARD_TIME_3T                           (((uint32_t)0x2 << LCD_GUARD_TIME_POS))
#define LCD_GUARD_TIME_4T                           (LCD_GUARD_TIME_MSK)

#define IS_LCD_GUARD_TIME(TIME) (((TIME) == LCD_GUARD_TIME_1T) || ((TIME) == LCD_GUARD_TIME_2T) || \
                                 ((TIME) == LCD_GUARD_TIME_3T) || ((TIME) == LCD_GUARD_TIME_4T))

/**
  * @}
  */

/** @defgroup LCD_8BitSwap LCD 8 Bit Swap
  * @{
  */

#define LCD_8BitSwap_DISABLE                        (0)
#define LCD_8BitSwap_ENABLE                         (LCD_8_BIT_SWAP_MSK)


#define IS_LCD_8BitSwap_CMD(CMD) (((CMD) == LCD_8BitSwap_DISABLE) || ((CMD) == LCD_8BitSwap_ENABLE))

/**
  * @}
  */

/** @defgroup LCD_16BitSwap LCD 16 Bit Swap
  * @{
  */

#define LCD_16BitSwap_DISABLE                       (0)
#define LCD_16BitSwap_ENABLE                        (LCD_16_BIT_SWAP_MSK)


#define IS_LCD_16BitSwap_CMD(CMD) (((CMD) == LCD_16BitSwap_DISABLE) || ((CMD) == LCD_16BitSwap_ENABLE))

/**
  * @}
  */

/** @defgroup LCD_TxDMACmd LCD Tx DMA Cmd
  * @{
  */

#define LCD_TX_DMA_ENABLE                           (LCD_TX_DMA_EN_MSK)
#define LCD_TX_DMA_DISABLE                          (0)


#define IS_LCD_TX_DMA_CMD(CMD) (((CMD) == LCD_TX_DMA_ENABLE) || ((CMD) == LCD_TX_DMA_DISABLE))

/**
  * @}
  */

/** @defgroup LCD_Flag_Definition  LCD Flag Definition
  * @{
  */

#define LCD_FLAG_TF_EMPTY                           (LCD_TX_FIFO_EMPTY_FLAG_MSK)
#define LCD_FLAG_TF_FULL                            (LCD_TX_FIFO_FULL_FLAG_MSK)

#define IS_LCD_FLAG_CONFIG(CONFIG)   (((CONFIG) == LCD_FLAG_TF_EMPTY) || \
                                      ((CONFIG) == LCD_FLAG_TF_FULL))

/**
  * @}
  */

/** @defgroup LCD_Interrupts_Mask_Definition  LCD Interrupts Mask Definition
  * @{
  */

#define LCD_INT_TF_EMPTY_MSK                        (LCD_MASK_TX_FIFO_EMPTY_INT_MSK)
#define LCD_INT_TF_OF_MSK                           (LCD_MASK_TX_FIFO_OVERFLOW_INT_MSK)
#define LCD_INT_TF_LEVEL_MSK                        (LCD_MASK_TX_FIFO_THR_INT_MSK)

#define IS_LCD_INT_MSK_CONFIG(CONFIG)   (((CONFIG) == LCD_INT_TF_EMPTY_MSK)  || \
                                         ((CONFIG) == LCD_INT_TF_OF_MSK)   || \
                                         ((CONFIG) == LCD_INT_TF_LEVEL_MSK))

/**
  * @}
  */

/** @defgroup LCD_Interrupts_Definition  LCD Interrupts Definition
  * @{
  */
#define LCD_INT_SR_AUTO_DONE                        (LCD_AUTO_DONE_INT_MSK)
#define LCD_INT_SR_TF_EMPTY                         (LCD_TX_FIFO_EMPTY_INT_MSK)
#define LCD_INT_SR_TF_OF                            (LCD_TX_FIFO_OVERFLOW_INT_MSK)
#define LCD_INT_SR_TF_LEVEL                         (LCD_TX_FIFO_THR_INT_MSK)

#define IS_LCD_INT_CONFIG(CONFIG)       (((CONFIG) == LCD_INT_SR_AUTO_DONE)  || \
                                         ((CONFIG) == LCD_INT_SR_TF_EMPTY) || \
                                         ((CONFIG) == LCD_INT_SR_TF_OF)   || \
                                         ((CONFIG) == LCD_INT_SR_TF_LEVEL))

/**
  * @}
  */


/** @defgroup LCD_Interrupts_Clear_Status LCD Interrupts Clear Status
  * @{
  */

#define LCD_INT_AUTO_DONE_CLR                       (LCD_CLR_AUTO_DONE_INT_MSK)
#define LCD_INT_TF_EMPTY_CLR                        (LCD_CLR_TF_EMPTY_INT_MSK)
#define LCD_INT_TF_OF_CLR                           (LCD_CLR_TF_OF_INT_MSK)
#define LCD_INT_TF_LEVEL_CLR                        (LCD_CLR_TF_THR_INT_MSK)

#define IS_LCD_INT_CLEAR(INT)           (((INT) == LCD_INT_AUTO_DONE_CLR) || ((INT) == LCD_INT_TF_EMPTY_CLR) || \
                                         ((INT) == LCD_INT_TF_OF_CLR) || ((INT) == LCD_INT_TF_LEVEL_CLR))

/**
  * @}
  */


/**End of group LCD_Exported_Constants
  * @}
  */

/** @defgroup LCD_Exported_Functions LCD Exported Functions
  * @{
  */

/**
  * @brief  Deinitializes the LCD peripheral registers to their default values.
  * @param  None.
  * @retval None
  */
void LCD_DeInit(void);

/**
  * @brief  Select the LCD output pin group.
  * @param LCD_PinGroupType:
    This parameter can be one of the following values:
    --LCD_PinGroup_DISABLE : disable LCD interface
    --LCD_PinGroup_1 : CS(P3_3), RD(P3_2), DCX(P3_4), WR(P3_5),
      D0(P0_2), D1(P0_4), D2(P1_3), D3(P1_4), D4(P4_0), D5(P4_1), D6(P4_2), D7(P4_3)
    --LCD_PinGroup_2 : CS(P3_3), DCX(P3_4), WR(P3_2), RD(P2_0)
      D0(P3_5), D1(P0_1), D2(P0_2), D3(P0_4), D4(P4_0), D5(P4_1), D6(P4_2), D7(P4_3)
  * @retval None
  */
void LCD_PinGroupConfig(uint32_t LCD_PinGroupType);

/**
  * @brief Initializes the LCD peripheral according to the specified
  *   parameters in the LCD_InitStruct
  * @param  LCD: selected LCD peripheral.
  * @param  LCD_InitStruct: pointer to a LCD_InitTypeDef structure that
  *   contains the configuration information for the specified LCD peripheral
  * @retval None
  */
void LCD_Init(LCD_InitTypeDef *LCD_InitStruct);

/**
  * @brief  Fills each LCD_InitStruct member with its default value.
  * @param  LCD_InitStruct: pointer to an LCD_InitTypeDef structure which will be initialized.
  * @retval None
  */
void LCD_StructInit(LCD_InitTypeDef *LCD_InitStruct);

/**
  * @brief   Enable or disable the selected LCD mode.
  * @param  NewState: new state of the operation mode.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void LCD_Cmd(FunctionalState NewState);

/**
  * @brief   Send command in manual mode.
  * @param  cmd: command which to be sent.
  * @retval None
  */
void LCD_SendCommand(uint8_t cmd);

/**
  * @brief   Send data in manual mode.
  * @param  pBuf: buffer address to be sent.
  * @param  len:  data length.
  * @retval None
  */
void LCD_SendData(uint8_t *pBuf, uint32_t len);

/**
  * @brief   Receive data in manual mode.
  * @param  pBuf: buffer address to be received.
  * @param  len: data length.
  * @retval None
  */
void LCD_ReceiveData(uint8_t *pBuf, uint32_t len);

/**
  * @brief   Send command and data buffer in manual mode.
  * @param cmd: command which to be sent.
  * @param  pBuf: buffer address to be sent.
  * @param  len:  data length.
  * @retval None
  */
void LCD_Write(uint8_t cmd, uint8_t *pBuf, uint32_t len);

/**
  * @brief   Send command and read data buffer in manual mode.
  * @param cmd: command which to be sent.
  * @param  pBuf: buffer address to be sent.
  * @param  len:  data length.
  * @retval None
  */
void LCD_Read(uint8_t cmd, uint8_t *pBuf, uint32_t len);

/**
  * @brief   Configure command sequences in auto mode.
 * @param  pCmdBuf: buffer address which store command sequence.
  * @param  len:  command length.
  * @retval None
  */
FlagStatus LCD_SetCmdSequence(uint8_t *pCmdBuf, uint8_t len);

/**
  * @brief  Mask or unmask the specified LCD interrupts.
  * @param  LCD_INT_MSK: specifies the LCD interrupts sources to be mask or unmask.
  *   This parameter can be the following values:
  *     @arg LCD_INT_TF_EMPTY_MSK: Mask TX FIFO empty interrupt.
  *     @arg LCD_INT_TF_OF_MSK: Mask TX FIFO overflow interrupt.
  *     @arg LCD_INT_TF_LEVEL_MSK: Mask TX FIFO threshold interrupt.
  * @param  NewState: new state of the specified LCD interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void LCD_MaskINTConfig(uint32_t LCD_INT_MSK, FunctionalState NewState);

/**
  * @brief Get the specified LCD interrupt status.
  * @param  LCD_INT: the specified LCD interrupts.
  * This parameter can be one of the following values:
  *       @arg LCD_INT_SR_AUTO_DONE: Auto done interrupt.
  *     @arg LCD_INT_SR_TF_EMPTY: TX FIFO empty interrupt.
  *     @arg LCD_INT_SR_TF_OF: TX FIFO overflow interrupt.
  *     @arg LCD_INT_SR_TF_LEVEL: TX FIFO threshold interrupt.
  * @retval The new state of LCD_INT (SET or RESET).
  */
ITStatus LCD_GetINTStatus(uint32_t LCD_INT);

/**
  * @brief Get the specified LCD flag status.
  * @param  LCD_INT: the specified LCD flag.
  * This parameter can be one of the following values:
  *   This parameter can be the following values:
  *     @arg LCD_FLAG_TF_EMPTY:  FIFO empty flag.
  *     @arg LCD_FLAG_TF_FULL:  FIFO full flag.
  * @retval The new state of LCD_FLAG (SET or RESET).
  */
FlagStatus LCD_GetFlagStatus(uint32_t LCD_FLAG);

/**
  * @brief   Dynamic switch LCD operation mode.
  * @param  mode: selected LCD operation mode.
  *   This parameter can be the following values:
  *     @arg LCD_MODE_AUTO: automation mode.
  *     @arg LCD_MODE_MANUAL: manual mode.
  * @retval None
  */
__STATIC_INLINE void LCD_SwitchMode(uint32_t mode)
{
    LCD->CFG &= LCD_MODE_CLR;
    LCD->CFG |= mode;
}

/**
  * @brief  Enable or disable GDMA for LCD transmission.
  * @param  NewState: new state of GDMA.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
__STATIC_INLINE void LCD_GDMACmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE)
    {
        LCD->CTRL1 |= LCD_TX_DMA_EN_MSK;
    }
    else
    {
        LCD->IMR &= LCD_TX_DMA_EN_CLR;
    }
}

/**
  * @brief  Set CS singal in manual mode.
  * @param  None
  * @retval None
  */
__STATIC_INLINE void LCD_SetCS(void)
{
    LCD->CFG |= LCD_MANUAL_CS_CTRL_MSK;
}

/**
  * @brief  Reset CS singal in manual mode.
  * @param  None
  * @retval None
  */
__STATIC_INLINE void LCD_ResetCS(void)
{
    LCD->CFG &= LCD_MANUAL_CS_CTRL_CLR;
}

/**
  * @brief  Clears the LCD interrupt pending bits.
  * @param  LCD_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg LCD_INT_AUTO_DONE_CLR: Clear auto done interrupt.
  *     @arg LCD_INT_TF_EMPTY_CLR: Clear TX FIFO empty interrupt.
  *     @arg LCD_INT_TF_OF_CLR: Clear TX FIFO overflow interrupt.
  *     @arg LCD_INT_TF_LEVEL_CLR: Clear TX FIFO threshold interrupt.
  * @retval None
  */
__STATIC_INLINE void LCD_ClearINTPendingBit(uint32_t LCD_CLEAR_INT)
{
    /* Check the parameters */
    assert_param(IS_LCD_INT_CLEAR(LCD_CLEAR_INT));

    LCD->ICR &= LCD_CLEAR_INT;
}

/**
 * @brief  set LCD output data length whose unit is byte.
 * @param  len : length of read data which can be 0 to 0x1FFFF.
 * @retval None
 */
__STATIC_INLINE uint32_t LCD_SetTxDataLen(uint32_t len)
{
    return LCD->RGB_LEN = len & LCD_OUTPUT_BYTE_NUM_MSK;
}

/**
 * @brief  Get LCD output data length whose unit is byte.
 * @param  None.
 * @retval length of read data which can be 0 to 0x1FFFF
 */
__STATIC_INLINE uint32_t LCD_GetTxDataLen(void)
{
    return (LCD->RGB_LEN & LCD_OUTPUT_BYTE_NUM_MSK);
}

/**
 * @brief  Get LCD output data counter whose unit is byte.
 * @param  None.
 * @retval length of counter which can be 0 to 0x1FFFF
 */
__STATIC_INLINE uint32_t LCD_GetDataCounter(void)
{
    return (LCD->DATA_CNT & LCD_OUTPUT_CNT_MSK);
}

/**
 * @brief  Clear LCD output data counter value.
 * @param  None.
 * @retval None
 */
__STATIC_INLINE void LCD_ClearDataCounter(void)
{
    LCD->ICR &= LCD_CLR_OUTPUT_CNT_MSK;
}

/**
 * @brief  Write LCD FIFO in auto mode.
 * @param  data: FIFO data.
 * @retval None
 */
__STATIC_INLINE void LCD_WriteFIFO(uint32_t data)
{
    LCD->FIFO = data;
}

/**
 * @brief  Clear LCD output data counter value.
 * @param  None.
 * @retval None
 */
__STATIC_INLINE void LCD_ClearFIFO(void)
{
    LCD->ICR &= LCD_CLR_FIFO_MSK;
}

#ifdef __cplusplus
}
#endif

#endif /* _RTL876x_LCD_H_ */

/**End of group LCD_Exported_Functions
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2017 Realtek Semiconductor Corporation *****END OF FILE****/

